app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
   def index
      @users = User.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "users" ("name", "email", "password_digest", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
     @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE (1) LIMIT 1
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "RABNAWAZ"], ["password_digest", "$2a$10$gTScnV6WcyaxLsiL0SSJuOKRDCvVIIlJpQMetfhzv8WWBP314x7Mu"], ["updated_at", "2015-10-16 07:37:35.738612"], ["id", 1]]
---
  def update
    @user = User.find_by(params[:id])
    if @user.update_attributes(user_params)